# Autosuggestions
zsh-users/zsh-autosuggestions

# History substring search
zsh-users/zsh-history-substring-search

# OMZ utility plugins (loaded individually, no full OMZ framework)
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/docker

# Additional completions
zsh-users/zsh-completions

# Replace default completion menu with fzf
Aloxaf/fzf-tab

# Syntax highlighting (must be last, replacing slower zsh-users/zsh-syntax-highlighting)
zdharma-continuum/fast-syntax-highlighting
